{
  "char_to_idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "A": 2,
    "B": 3,
    "C": 4,
    "D": 5,
    "E": 6,
    "G": 7,
    "H": 8,
    "I": 9,
    "J": 10,
    "K": 11,
    "L": 12,
    "M": 13,
    "N": 14,
    "O": 15,
    "P": 16,
    "R": 17,
    "S": 18,
    "T": 19,
    "U": 20,
    "W": 21,
    "Y": 22,
    "a": 23,
    "b": 24,
    "c": 25,
    "d": 26,
    "e": 27,
    "g": 28,
    "h": 29,
    "i": 30,
    "j": 31,
    "k": 32,
    "l": 33,
    "m": 34,
    "n": 35,
    "o": 36,
    "p": 37,
    "r": 38,
    "s": 39,
    "t": 40,
    "u": 41,
    "v": 42,
    "w": 43,
    "y": 44
  },
  "tag_to_idx": {
    "B": 0,
    "I": 1
  },
  "idx_to_char": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "A",
    "3": "B",
    "4": "C",
    "5": "D",
    "6": "E",
    "7": "G",
    "8": "H",
    "9": "I",
    "10": "J",
    "11": "K",
    "12": "L",
    "13": "M",
    "14": "N",
    "15": "O",
    "16": "P",
    "17": "R",
    "18": "S",
    "19": "T",
    "20": "U",
    "21": "W",
    "22": "Y",
    "23": "a",
    "24": "b",
    "25": "c",
    "26": "d",
    "27": "e",
    "28": "g",
    "29": "h",
    "30": "i",
    "31": "j",
    "32": "k",
    "33": "l",
    "34": "m",
    "35": "n",
    "36": "o",
    "37": "p",
    "38": "r",
    "39": "s",
    "40": "t",
    "41": "u",
    "42": "v",
    "43": "w",
    "44": "y"
  },
  "idx_to_tag": {
    "0": "B",
    "1": "I"
  },
  "vocab_stats": {
    "vocab_size": 45,
    "tag_vocab_size": 2,
    "unique_chars": 43,
    "total_samples": 13746,
    "total_characters": 77158,
    "char_frequency": {
      "a": 11019,
      "n": 7190,
      "g": 6096,
      "e": 7092,
      "w": 730,
      "t": 3784,
      "r": 3687,
      "p": 2849,
      "y": 639,
      "h": 1376,
      "c": 1311,
      "i": 4587,
      "d": 2294,
      "o": 2500,
      "k": 4115,
      "m": 2345,
      "l": 3788,
      "s": 3338,
      "u": 4684,
      "b": 2518,
      "j": 879,
      "A": 16,
      "U": 12,
      "M": 35,
      "W": 24,
      "B": 21,
      "P": 29,
      "K": 33,
      "C": 13,
      "D": 28,
      "E": 2,
      "G": 8,
      "v": 11,
      "T": 17,
      "H": 5,
      "I": 8,
      "J": 10,
      "R": 10,
      "L": 11,
      "S": 31,
      "N": 8,
      "O": 4,
      "Y": 1
    },
    "tag_frequency": {
      "B": 13746,
      "I": 63412
    },
    "word_length_stats": {
      "min": 1,
      "max": 17,
      "mean": 5.613123817837916,
      "std": 1.5065836522161122,
      "percentiles": {
        "25th": 5.0,
        "50th": 5.0,
        "75th": 6.0,
        "95th": 8.0
      }
    }
  }
}